## :tipping_hand_person: `terraform plan` results for cloudflare/jizi.jp/dns
<details>
<summary>show results</summary>

```
data.sops_file.cloudflare: Reading...
data.sops_file.cloudflare: Read complete after 0s [id=-]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record._2021-members will be created
  + resource "cloudflare_record" "_2021-members" {
      + allow_overwrite = false
      + comment         = "2021年度の参加団体向けサイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "2021.members"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record._48 will be created
  + resource "cloudflare_record" "_48" {
      + allow_overwrite = false
      + comment         = "古のドルオタ集団サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "48"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record._7526674 will be created
  + resource "cloudflare_record" "_7526674" {
      + allow_overwrite = false
      + comment         = "sendgrid"
      + content         = "sendgrid.net"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "7526674"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record._acme-challenge-dev-fuyuga2020 will be created
  + resource "cloudflare_record" "_acme-challenge-dev-fuyuga2020" {
      + allow_overwrite = false
      + comment         = "fuyuga2020のLet's Encrypt関係？"
      + content         = "fJtxT5Kv7GjwsJUswiNaLvxmkw22vKLpQZ_yqBwkwiE"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_acme-challenge.dev.fuyuga2020"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record._acme-challenge-localhost will be created
  + resource "cloudflare_record" "_acme-challenge-localhost" {
      + allow_overwrite = false
      + comment         = "不明"
      + content         = "5YwtQ5MCju02xqvVvILlIFROtno498Hhn8GesW1_MSg"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_acme-challenge.localhost"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record._acme-challenge-www-dev-fuyuga2020 will be created
  + resource "cloudflare_record" "_acme-challenge-www-dev-fuyuga2020" {
      + allow_overwrite = false
      + comment         = "fuyuga2020のLet's Encrypt関係？"
      + content         = "AWZpLJ4FL1DQrDIIw-5eRwXceQHnih0Xk_Namp3NQeA"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_acme-challenge.www.dev.fuyuga2020"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record._dmarc will be created
  + resource "cloudflare_record" "_dmarc" {
      + allow_overwrite = false
      + comment         = "ルートドメインのDMARCレコード"
      + content         = "v=DMARC1; p=none;"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_dmarc"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record._dmarc-mailtransfer will be created
  + resource "cloudflare_record" "_dmarc-mailtransfer" {
      + allow_overwrite = false
      + comment         = "mailtransferのDMARCレコード"
      + content         = "v=DMARC1; p=none;"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_dmarc"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.adminer will be created
  + resource "cloudflare_record" "adminer" {
      + allow_overwrite = false
      + comment         = "adminer"
      + content         = "db1.jizi.jp"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "adminer"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.api will be created
  + resource "cloudflare_record" "api" {
      + allow_overwrite = false
      + comment         = "不明。謎のAPI"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "api"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.api3 will be created
  + resource "cloudflare_record" "api3" {
      + allow_overwrite = false
      + comment         = "不明。謎のAPI"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "api3"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.auth will be created
  + resource "cloudflare_record" "auth" {
      + allow_overwrite = false
      + comment         = "keycloak(今はauth2024が使用されている)"
      + content         = "n1.jizi.jp"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "auth"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.auth2024 will be created
  + resource "cloudflare_record" "auth2024" {
      + allow_overwrite = false
      + comment         = "JIZI PortalのKeycloak"
      + content         = "n1.jizi.jp"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "auth2024"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.cloud will be created
  + resource "cloudflare_record" "cloud" {
      + allow_overwrite = false
      + comment         = "JIZIクラウド"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "cloud"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.db-cloud will be created
  + resource "cloudflare_record" "db-cloud" {
      + allow_overwrite = false
      + content         = "160.251.106.248"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "db-cloud"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.db-form will be created
  + resource "cloudflare_record" "db-form" {
      + allow_overwrite = false
      + content         = "160.251.167.132"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "db-form"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.db-portal will be created
  + resource "cloudflare_record" "db-portal" {
      + allow_overwrite = false
      + content         = "160.251.106.248"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "db-portal"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.db1 will be created
  + resource "cloudflare_record" "db1" {
      + allow_overwrite = false
      + comment         = "db1"
      + content         = "163.44.125.116"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "db1"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.default-_domainkey will be created
  + resource "cloudflare_record" "default-_domainkey" {
      + allow_overwrite = false
      + comment         = "DKIMレコード"
      + content         = "v=DKIM1; k=rsa; p=MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAzZGqaP+UTQ7+hTNut/G36JTOTfw2nac9tOsvwqb6WyLfc93yfZvjzn7FL5E73LiiO//uoNE9md1FqVw8MjZ7JtDowFO/y06RybnMAaE4fvvnpYgXc9mhK5i2CuwICOgxxnsOsO12KCQh4e26wDN2tv+nZ5wtsIkFOBO9+dHAo0gjMRD1N8nnW2lzIol8IZHpoEAlVRlBQ0WsjIeAXuNgleJ+Of5R6/+BMfVYGHr0M/QXMfCiCmmzpFkOxNGYqpL6wsnoudJK5CvFTAtZvXX5AJNpSuomY367ndOJJdGUj+1Hm0ctag51AP/TVp6j2LyKUCHzfa/Y3Cp+/YcCujgnrwIDAQAB"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "default._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.dev-goukaku will be created
  + resource "cloudflare_record" "dev-goukaku" {
      + allow_overwrite = false
      + comment         = "旧受験生応援サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "dev.goukaku"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.dev-picody will be created
  + resource "cloudflare_record" "dev-picody" {
      + allow_overwrite = false
      + comment         = "ピコディサイト開発"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "dev.picody"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.develop-official2025 will be created
  + resource "cloudflare_record" "develop-official2025" {
      + allow_overwrite = false
      + comment         = "2025年度公式サイト開発用"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "develop.official2025"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.dom-line-agent will be created
  + resource "cloudflare_record" "dom-line-agent" {
      + allow_overwrite = false
      + comment         = "渉内のLINE Botのエンドポイント"
      + content         = "n1.jizi.jp"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "dom-line-agent"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.em1935 will be created
  + resource "cloudflare_record" "em1935" {
      + allow_overwrite = false
      + comment         = "SendGrid"
      + content         = "u7526674.wl175.sendgrid.net"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "em1935"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.exective2020 will be created
  + resource "cloudflare_record" "exective2020" {
      + allow_overwrite = false
      + comment         = "2020年度重役紹介サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "exective2020"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.exective2021 will be created
  + resource "cloudflare_record" "exective2021" {
      + allow_overwrite = false
      + comment         = "2021年度重役紹介サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "exective2021"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.farewell will be created
  + resource "cloudflare_record" "farewell" {
      + allow_overwrite = false
      + comment         = "2017年度の引退者見送りサイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "farewell"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.files will be created
  + resource "cloudflare_record" "files" {
      + allow_overwrite = false
      + comment         = "静的ファイル配置用サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "files"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.form will be created
  + resource "cloudflare_record" "form" {
      + allow_overwrite = false
      + comment         = "JIZI Form"
      + content         = "160.251.167.132"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "form"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.fuyuga2013 will be created
  + resource "cloudflare_record" "fuyuga2013" {
      + allow_overwrite = false
      + comment         = "2013年度冬合宿サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fuyuga2013"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.fuyuga2014 will be created
  + resource "cloudflare_record" "fuyuga2014" {
      + allow_overwrite = false
      + comment         = "2014年度冬合宿サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fuyuga2014"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.fuyuga2015 will be created
  + resource "cloudflare_record" "fuyuga2015" {
      + allow_overwrite = false
      + comment         = "2015年度冬合宿サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fuyuga2015"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.fuyuga2016 will be created
  + resource "cloudflare_record" "fuyuga2016" {
      + allow_overwrite = false
      + comment         = "2016年度冬合宿サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fuyuga2016"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.fuyuga2017 will be created
  + resource "cloudflare_record" "fuyuga2017" {
      + allow_overwrite = false
      + comment         = "2017年度冬合宿サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fuyuga2017"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.fuyuga2018 will be created
  + resource "cloudflare_record" "fuyuga2018" {
      + allow_overwrite = false
      + comment         = "2018年度冬合宿サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fuyuga2018"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.fuyuga2019 will be created
  + resource "cloudflare_record" "fuyuga2019" {
      + allow_overwrite = false
      + comment         = "2019年度冬合宿サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fuyuga2019"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.fuyuga2020 will be created
  + resource "cloudflare_record" "fuyuga2020" {
      + allow_overwrite = false
      + comment         = "2020年度冬合宿サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fuyuga2020"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.fuyuga2021 will be created
  + resource "cloudflare_record" "fuyuga2021" {
      + allow_overwrite = false
      + comment         = "2021年度冬合宿サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fuyuga2021"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.fuyuga2022 will be created
  + resource "cloudflare_record" "fuyuga2022" {
      + allow_overwrite = false
      + comment         = "2022年度冬合宿サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fuyuga2022"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.fuyuga2023 will be created
  + resource "cloudflare_record" "fuyuga2023" {
      + allow_overwrite = false
      + comment         = "2023年度冬合宿サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fuyuga2023"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.fuyuga2024 will be created
  + resource "cloudflare_record" "fuyuga2024" {
      + allow_overwrite = false
      + comment         = "2024年度冬合宿サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fuyuga2024"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.git will be created
  + resource "cloudflare_record" "git" {
      + allow_overwrite = false
      + comment         = "Gitea"
      + content         = "n1.jizi.jp"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "git"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.gle will be created
  + resource "cloudflare_record" "gle" {
      + allow_overwrite = false
      + comment         = "googleのサイト検証用"
      + content         = "google-site-verification=M4cj5rjkXoFCoGrLcGyGuubg5s0QI0nOe1T3tnP3XJk"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "gle"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.goukaku will be created
  + resource "cloudflare_record" "goukaku" {
      + allow_overwrite = false
      + comment         = "受験生応援サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "goukaku"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.hitowari will be created
  + resource "cloudflare_record" "hitowari" {
      + allow_overwrite = false
      + comment         = "旧人割サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "hitowari"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.imap will be created
  + resource "cloudflare_record" "imap" {
      + allow_overwrite = false
      + comment         = "IMAP"
      + content         = "118.27.100.82"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "imap"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.intro2021 will be created
  + resource "cloudflare_record" "intro2021" {
      + allow_overwrite = false
      + comment         = "2021年度他己紹介サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "intro2021"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.intro2022 will be created
  + resource "cloudflare_record" "intro2022" {
      + allow_overwrite = false
      + comment         = "2022年度他己紹介サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "intro2022"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.intro2023 will be created
  + resource "cloudflare_record" "intro2023" {
      + allow_overwrite = false
      + comment         = "2023年度他己紹介サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "intro2023"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.l6djjxxfwkrfukyn5xxh2ispbmw4vfyf-_domainkey will be created
  + resource "cloudflare_record" "l6djjxxfwkrfukyn5xxh2ispbmw4vfyf-_domainkey" {
      + allow_overwrite = false
      + comment         = "Amazon SESのDKIM"
      + content         = "l6djjxxfwkrfukyn5xxh2ispbmw4vfyf.dkim.amazonses.com"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "l6djjxxfwkrfukyn5xxh2ispbmw4vfyf._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.localhost will be created
  + resource "cloudflare_record" "localhost" {
      + allow_overwrite = false
      + comment         = "不明"
      + content         = "127.0.0.1"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "localhost"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.m will be created
  + resource "cloudflare_record" "m" {
      + allow_overwrite = false
      + comment         = "不明(おそらくConoHa WINGに必要)"
      + content         = "160.251.167.132"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "m"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.m_mx will be created
  + resource "cloudflare_record" "m_mx" {
      + allow_overwrite = false
      + comment         = "不明（おそらくWING関係の何か）"
      + content         = "160.251.167.132"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "m"
      + priority        = 1
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "MX"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.m_txt will be created
  + resource "cloudflare_record" "m_txt" {
      + allow_overwrite = false
      + comment         = "mのSPFレコード"
      + content         = "v=spf1 ip4:160.251.167.132 ~all"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "m"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.mail will be created
  + resource "cloudflare_record" "mail" {
      + allow_overwrite = false
      + comment         = "不明(おそらくConoHa WINGに必要)"
      + content         = "118.27.100.82"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mail"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.mailbot_mx will be created
  + resource "cloudflare_record" "mailbot_mx" {
      + allow_overwrite = false
      + comment         = "不明（何かのメールボット）"
      + content         = "mx.sendgrid.net"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mailbot"
      + priority        = 10
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "MX"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.mailfrom will be created
  + resource "cloudflare_record" "mailfrom" {
      + allow_overwrite = false
      + comment         = "mailfromのSPFレコード"
      + content         = "v=spf1 include:amazonses.com ~all"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mailfrom"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.mailfrom_mx will be created
  + resource "cloudflare_record" "mailfrom_mx" {
      + allow_overwrite = false
      + comment         = "Amazon SES"
      + content         = "feedback-smtp.ap-northeast-1.amazonses.com"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mailfrom"
      + priority        = 10
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "MX"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.mailtransfer_mx will be created
  + resource "cloudflare_record" "mailtransfer_mx" {
      + allow_overwrite = false
      + comment         = "メール転送用（s2d2につながる）"
      + content         = "mx.sendgrid.net"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mailtransfer"
      + priority        = 10
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "MX"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.md will be created
  + resource "cloudflare_record" "md" {
      + allow_overwrite = false
      + comment         = "CodiMD"
      + content         = "n1.jizi.jp"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "md"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.mgoypk7m4f5ah7cam5avii2e3jkacrtd-_domainkey will be created
  + resource "cloudflare_record" "mgoypk7m4f5ah7cam5avii2e3jkacrtd-_domainkey" {
      + allow_overwrite = false
      + comment         = "Amazon SESのDKIM"
      + content         = "mgoypk7m4f5ah7cam5avii2e3jkacrtd.dkim.amazonses.com"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mgoypk7m4f5ah7cam5avii2e3jkacrtd._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.mjizi-_domainkey will be created
  + resource "cloudflare_record" "mjizi-_domainkey" {
      + allow_overwrite = false
      + comment         = "DKIMレコード"
      + content         = "\"v=DKIM1; h=sha256; k=rsa; \" \"p=MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEA2UG2gPQ8zhnk8F0UpTCYrFgRlL8+cp+RD/E+A6D8YICybV4qv3eVBdJNOTQLpSMxsYJ8+WdV5AxlDUwahqNmvYztoR5S9LYxliupBe6namFJ/qREZIkrmaXOMjJQioLuG4vjU71maPXR/dm0bqSwP4QjeDDU+W861ztGMh0/Y2s0IJpgOCkLi5eARmFZGD5ZJgH7Nsa/vPpAbs\" \"9Yd38QQHhM5hux2Hl7Yk6U65Em2af88ehGYlcH7XYykciZoL1XAl3Ucv50tOaHe21DhIi4lQ/30pEHclN+DKlj8VS2YaDccyDXs+8Dvvhz+/Bnkh0UZ8YDp3dEGCtrWO0MmZjPYwIDAQAB\""
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "mjizi._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.ml will be created
  + resource "cloudflare_record" "ml" {
      + allow_overwrite = false
      + comment         = "ConoHa WINGのメーリングリストに関係するレコード？"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "ml"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.ml-cp will be created
  + resource "cloudflare_record" "ml-cp" {
      + allow_overwrite = false
      + comment         = "ConoHa WINGのメーリングリストコントロールパネル"
      + content         = "118.27.100.82"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "ml-cp"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.n1 will be created
  + resource "cloudflare_record" "n1" {
      + allow_overwrite = false
      + comment         = "VPS n1のIPアドレスを指す"
      + content         = "160.251.176.143"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "n1"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.net will be created
  + resource "cloudflare_record" "net" {
      + allow_overwrite = false
      + comment         = "不明．phpとhtmlのサンプルが複数置かれている．おそらくhtmlやphpの学習用に作られたサイト．"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "net"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.note will be created
  + resource "cloudflare_record" "note" {
      + allow_overwrite = false
      + comment         = "wikiの前身となるナレッジ共有サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "note"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.official2025 will be created
  + resource "cloudflare_record" "official2025" {
      + allow_overwrite = false
      + comment         = "2025年度工大祭公式サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "official2025"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.oxrgkjlgztiveu5fb44rjgn5euomw3ps-_domainkey will be created
  + resource "cloudflare_record" "oxrgkjlgztiveu5fb44rjgn5euomw3ps-_domainkey" {
      + allow_overwrite = false
      + comment         = "Amazon SESのDKIM"
      + content         = "oxrgkjlgztiveu5fb44rjgn5euomw3ps.dkim.amazonses.com"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "oxrgkjlgztiveu5fb44rjgn5euomw3ps._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.portal will be created
  + resource "cloudflare_record" "portal" {
      + allow_overwrite = false
      + comment         = "JIZI Portal"
      + content         = "n1.jizi.jp"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "portal"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.portal-preview will be created
  + resource "cloudflare_record" "portal-preview" {
      + allow_overwrite = false
      + comment         = "JIZI Portal(プレビュー環境)"
      + content         = "n1.jizi.jp"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "portal-preview"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.proof will be created
  + resource "cloudflare_record" "proof" {
      + allow_overwrite = false
      + comment         = "JIZIサイト校正"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "proof"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.proof-official2025 will be created
  + resource "cloudflare_record" "proof-official2025" {
      + allow_overwrite = false
      + comment         = "2025年度工大祭公式サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "proof.official2025"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.proof-welcome2025 will be created
  + resource "cloudflare_record" "proof-welcome2025" {
      + allow_overwrite = false
      + comment         = "2025年度新歓サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "proof.welcome2025"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.register-portal will be created
  + resource "cloudflare_record" "register-portal" {
      + allow_overwrite = false
      + comment         = "JIZI Portalアカウント登録サイト"
      + content         = "n1.jizi.jp"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "register.portal"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.root will be created
  + resource "cloudflare_record" "root" {
      + allow_overwrite = false
      + comment         = "JIZIホームページなど"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.root_mx will be created
  + resource "cloudflare_record" "root_mx" {
      + allow_overwrite = false
      + comment         = "jizi.jpメール"
      + content         = "mail52.conoha.ne.jp"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + priority        = 10
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "MX"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.s1-_domainkey will be created
  + resource "cloudflare_record" "s1-_domainkey" {
      + allow_overwrite = false
      + comment         = "SendGridのDKIM"
      + content         = "s1.domainkey.u7526674.wl175.sendgrid.net"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "s1._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.s2-_domainkey will be created
  + resource "cloudflare_record" "s2-_domainkey" {
      + allow_overwrite = false
      + comment         = "SendGridのDKIM"
      + content         = "s2.domainkey.u7526674.wl175.sendgrid.net"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "s2._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.shinkan2024 will be created
  + resource "cloudflare_record" "shinkan2024" {
      + allow_overwrite = false
      + comment         = "2024年度新歓委員会サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "shinkan2024"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.techchan will be created
  + resource "cloudflare_record" "techchan" {
      + allow_overwrite = false
      + comment         = "テックちゃんサイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "techchan"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.test will be created
  + resource "cloudflare_record" "test" {
      + allow_overwrite = false
      + comment         = "アニメーションのテスト用サイト？"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "test"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.tsuyuga2015 will be created
  + resource "cloudflare_record" "tsuyuga2015" {
      + allow_overwrite = false
      + comment         = "2015年度梅雨合宿サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "tsuyuga2015"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.tsuyuga2016 will be created
  + resource "cloudflare_record" "tsuyuga2016" {
      + allow_overwrite = false
      + comment         = "2016年度梅雨合宿サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "tsuyuga2016"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.tsuyuga2017 will be created
  + resource "cloudflare_record" "tsuyuga2017" {
      + allow_overwrite = false
      + comment         = "2017年度梅雨合宿サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "tsuyuga2017"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.tsuyuga2018 will be created
  + resource "cloudflare_record" "tsuyuga2018" {
      + allow_overwrite = false
      + comment         = "2018年度梅雨合宿サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "tsuyuga2018"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.tsuyuga2019 will be created
  + resource "cloudflare_record" "tsuyuga2019" {
      + allow_overwrite = false
      + comment         = "2019年度梅雨合宿サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "tsuyuga2019"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.tsuyuga2020 will be created
  + resource "cloudflare_record" "tsuyuga2020" {
      + allow_overwrite = false
      + comment         = "2020年度梅雨合宿サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "tsuyuga2020"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.tsuyuga2021 will be created
  + resource "cloudflare_record" "tsuyuga2021" {
      + allow_overwrite = false
      + comment         = "2021年度梅雨合宿サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "tsuyuga2021"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.tsuyuga2022 will be created
  + resource "cloudflare_record" "tsuyuga2022" {
      + allow_overwrite = false
      + comment         = "2022年度梅雨合宿サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "tsuyuga2022"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.tsuyuga2023 will be created
  + resource "cloudflare_record" "tsuyuga2023" {
      + allow_overwrite = false
      + comment         = "2023年度梅雨合宿サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "tsuyuga2023"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.tsuyuga2024 will be created
  + resource "cloudflare_record" "tsuyuga2024" {
      + allow_overwrite = false
      + comment         = "2024年度梅雨合宿サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "tsuyuga2024"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.tsuyuga2025 will be created
  + resource "cloudflare_record" "tsuyuga2025" {
      + allow_overwrite = false
      + comment         = "2025年度梅雨合宿サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "tsuyuga2025"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.tutorial will be created
  + resource "cloudflare_record" "tutorial" {
      + allow_overwrite = false
      + comment         = "サイト担当のチュートリアルサイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "tutorial"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.url7478 will be created
  + resource "cloudflare_record" "url7478" {
      + allow_overwrite = false
      + comment         = "SendGridの何か"
      + content         = "sendgrid.net"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "url7478"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.user will be created
  + resource "cloudflare_record" "user" {
      + allow_overwrite = false
      + comment         = "練習用サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "user"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.webmail will be created
  + resource "cloudflare_record" "webmail" {
      + allow_overwrite = false
      + comment         = "ウェブメール"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "webmail"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.welcome will be created
  + resource "cloudflare_record" "welcome" {
      + allow_overwrite = false
      + comment         = "新歓サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "welcome"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.welcome2015 will be created
  + resource "cloudflare_record" "welcome2015" {
      + allow_overwrite = false
      + comment         = "2015年度新歓サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "welcome2015"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.welcome2016 will be created
  + resource "cloudflare_record" "welcome2016" {
      + allow_overwrite = false
      + comment         = "2016年度新歓サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "welcome2016"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.welcome2017 will be created
  + resource "cloudflare_record" "welcome2017" {
      + allow_overwrite = false
      + comment         = "2017年度新歓サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "welcome2017"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.welcome2018 will be created
  + resource "cloudflare_record" "welcome2018" {
      + allow_overwrite = false
      + comment         = "2018年度新歓サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "welcome2018"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.welcome2019 will be created
  + resource "cloudflare_record" "welcome2019" {
      + allow_overwrite = false
      + comment         = "2019年度新歓サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "welcome2019"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.welcome2020 will be created
  + resource "cloudflare_record" "welcome2020" {
      + allow_overwrite = false
      + comment         = "2020年度新歓サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "welcome2020"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.welcome2024 will be created
  + resource "cloudflare_record" "welcome2024" {
      + allow_overwrite = false
      + comment         = "2024年度新歓サイト"
      + content         = "118.27.100.87"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "welcome2024"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

  # cloudflare_record.wiki will be created
  + resource "cloudflare_record" "wiki" {
      + allow_overwrite = false
      + comment         = "JIZI Wiki"
      + content         = "n1.jizi.jp"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "wiki"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "03a1a7cfb891bdce3ddc526efb7ef83a"
    }

Plan: 106 to add, 0 to change, 0 to destroy.
```

</details>